void main() {
  String text = """""الوظيفية أكثر أهمية فى بعض أحيان من الوظيفة ذاتها ، فكان يردد أن : قد عملت باجتهاد فى الحكومة <spl>، وأستحق هذه المنافع
  أما الأب الآخر ، فآمن بالاعتماد المالى الذاتى الكامل ، " المستحقات " وكيف أوجدت أناساً معوزين وذوى مركز مالي واهن . وكان
  وانتقد عقلية<spl>
  يشدد على تحقيق الجدارة المالية كان أحدهما يكافح ليدخر قلة من الدولارات ، فيما كان الآخر يبنى
  الاستثمارات بسهولة<spl>.
  علمنی أحدهما كيف أكتب التماسا مؤثرا يخولني الحصول على وظيفة ، بينما علمني الآخر الصياغة الحسنة لخطط المال والأعمال لأخلق وظائف
  للآخرين<spl>
  وكونى محصلة لفكرى أبوين مؤثرين ، أتاح لى ذلك ملاحظة أثر توجهين فكريين مختلفين على حياة صاحبيهما . فعلمت أن الناس حقا يشكلون حياتهم
  من خلال أفكارهم<spl>
  فعلى سبيل المثال ، كان أبى الفقير يقول دوما : " لن أحقق الثراء أبدا وقد أضحت تلك النبوءة حقيقة ، أما والدى الثرى فعلى الطرف الآخر ، كان يشير لنفسه على الدوام بكونه ثرياً. كان يقول أشياء <spl>مثل : " إنني رجل ثرى ، والأثرياء لا يفعلون هذا " ، وحتى بعدما تعرض لأزمة مالية بكل ما
  تحمله الكلمة من معنى ، استمر يشير لنفسه كرجل ثرى. وكان يعلق على أزمته قائلا : " هناك فارق بين كون المرء معوزا ، وبين تعرضه لأزمة مالية فالأزمات وقتية ، أما الفقر فأبدى<spl>
  أما أبي الفقير ، فكان يقول : " لا يتملكني الاهتمام بالمال أو " إن المال ليس شيئا مهماً " ، بينما كان أبى الثرى يقول : " المال قوة " وقد لا نستطيع قياس قوة أفكارنا أبدا أو تقدير قوتها ، لكنه أضحى جليا لى كطفل أن أكون واعيا بأفكارى وبالكيفية التي أرمز بها <spl>لنفسي فإننا نجذب لأنفسنا ما نفكر فيه ، فلقد لاحظت أن والدى الفقير كان فقيرا ليس بسبب قدر المال الذى كان يجنيه - والذى كان كبيرا - ولكن كان ذلك بسبب أفكاره وسلوكياته . وكفتى صغير عايش أبوين ، أضحيت واعيا تمام الوعى بالحذر من أى الأفكار أعتنقها لنفسي ، وأى الأبوين أنصت إليه ، هل أنصت للثرى منهما أم للفقير ؟<spl>
  وعلى الرغم من أن كلا الرجلين بالغ مبالغة عظيمة في احترام التعليم والتعلم ، إلا أنهما اختلفا فيما ارتأياه جديرا بالتعلم ، فقد أرادني أحدهما أن أدرس بجد وأنال درجات وأحصل على وظيفة لأجنى المال . <spl>لقد أراد من الدراسة أن أصير محترفا، أى أن أصير محاميا أو محاسبا أو أن أدرس لأحصل على الماجيستير ، أما الآخر ، فشجعني على الدراسة لأصير ثريا ،<spl> ولأفهم طبيعة المال ولأتعلم كيف أضعه موضع العمل لصالحي . " إنني لا أعمل من أجل المال ،<spl> بل المال هو ما يعمل لأجلى " تلك كلمات كان يرددها على مسامعي مرارا وتكرارا وفى سن التاسعة ، قررت أن أنصت وأن أتعلم من والدي الثرى ما يقوله عن المال ، وفي سعيى هذا ، اخترت ألا أنصت لوالدى الفقير ، وإن كان هو الحاصل على كل الدرجات الجامعية<spl> .
  """;


  List<String> phrases = text.split("<spl>");
  print(phrases.length);

  // Print each phrase in the list
  for (String phrase in phrases) {
    print("+"*300);
    print(phrase.trim()); // Trim to remove leading/trailing spaces
  }
}